{
  "story_id": "lean_startup_quest",
  "languages": ["en", "ar"],
  "nodes": [
    {
      "node_id": "intro",
      "text_ar": "في قلب مدينة هافنوود التي مزقتها الصراعات، تحلم المهندسة الشابة إيلارا وصديقها المغامر ليام بإعادة النور والأمل إلى مجتمعهما. لقد اكتشفوا تقنية اندماج قديمة يمكن أن توفر طاقة غير محدودة، لكن مواردهم شحيحة. يواجهون قرارهم الأول: هل يجب عليهم استثمار كل شيء في بناء مولد كامل الحجم، أم البدء بنموذج أولي صغير (MVP) لإثبات المفهوم أولاً؟",
      "image_url": "intro.png",
      "choices": [
        {
          "choice_text_ar": "بناء المولد الكامل فورًا.",
          "next_node_id": "choice_full_scale"
        },
        {
          "choice_text_ar": "بناء مولد صغير لغرفة واحدة كنموذج أولي.",
          "next_node_id": "choice_mvp"
        }
      ]
    },
    {
      "node_id": "choice_full_scale",
      "text_ar": "يصب إيلارا وليام كل مواردهما في بناء المولد الكامل. العمل شاق، والمجتمع متشكك. عندما يفشل النموذج الأولي في الاشتعال، يتصاعد الإحباط. يتهمهم الناس بإهدار الموارد الثمينة. لقد تعلموا بالطريقة الصعبة أن بناء شيء لا يريده أحد هو مضيعة للوقت والجهد.",
      "image_url": "full_scale_fail.png",
      "choices": [
        {
          "choice_text_ar": "تجاهل ملاحظات المجتمع والمحاولة مرة أخرى.",
          "next_node_id": "ending_failure"
        },
        {
          "choice_text_ar": "الاستماع إلى مخاوفهم والتكيف.",
          "next_node_id": "pivot_to_feedback"
        }
      ]
    },
    {
      "node_id": "choice_mvp",
      "text_ar": "يقومون ببناء مولد صغير يعمل بالطاقة لغرفة واحدة فقط. إنه ليس مثيرًا للإعجاب، لكنه يعمل! يستخدمه المجتمع لشحن أجهزتهم وتدفئة مساحة صغيرة. الأهم من ذلك، أنهم يقدمون ملاحظات قيمة: إنهم بحاجة إلى الدفء أكثر من الكهرباء. لقد تحققوا من صحة حاجتهم وحصلوا على رؤى قابلة للتنفيذ.",
      "image_url": "mvp_success.png",
      "choices": [
        {
          "choice_text_ar": "التوسع ببطء، بناءً على ملاحظات المستخدم.",
          "next_node_id": "iterate_and_grow"
        },
        {
          "choice_text_ar": "محور التركيز على توفير حلول التدفئة.",
          "next_node_id": "pivot_to_heat"
        }
      ]
    },
    {
      "node_id": "ending_failure",
      "text_ar": "أعمى بسبب عنادهم، يواصلون العمل على المولد الكبير. تنفد الموارد، ويفقد المجتمع الثقة، ويتم التخلي عن المشروع. فشلت رؤيتهم لأنهم لم يتوقفوا أبدًا للتحقق مما إذا كان أي شخص يشاركهم فيها. الدرس: الفشل في التعلم هو الفشل الأكبر على الإطلاق.",
      "image_url": "ending_failure.png"
    },
    {
      "node_id": "pivot_to_feedback",
      "text_ar": "بعد الفشل الأولي، يتحدثون مع المجتمع. يكتشفون أن مصدر قلقهم الحقيقي هو الشتاء القارس القادم. لقد تعلموا أن الأمر لا يتعلق بالمنتج، بل بحل مشكلة حقيقية. هذا هو مفهوم 'المحور' في منهجية لين.",
      "image_url": "community_talk.png",
      "choices": [
        {
          "choice_text_ar": "إعادة تصميم المولد للتدفئة.",
          "next_node_id": "pivot_to_heat"
        }
      ]
    },
    {
      "node_id": "iterate_and_grow",
      "text_ar": "بناءً على نجاح النموذج الأولي، يقومون بتحسين المولد وتوسيعه تدريجيًا. كل تكرار يحل مشكلة أكبر، وكل ذلك يتم توجيهه من خلال 'المحاسبة الابتكارية' - قياس ما ينجح وما لا ينجح. يصبح مشروعهم شريان الحياة للمدينة.",
      "image_url": "city_growth.png",
      "choices": [
        {
          "choice_text_ar": "النهاية: نجاح من خلال التكرار.",
          "next_node_id": "ending_success"
        }
      ]
    },
    {
      "node_id": "pivot_to_heat",
      "text_ar": "لقد قاموا بتحويل تركيزهم بشكل جذري. لقد قاموا بتفكيك أجزاء من مولدهم وإعادة تصميمها لإنشاء 'قلب الانصهار' - سخان مجتمعي فعال. لقد حقق نجاحًا فوريًا، وأنقذ الكثيرين من البرد. لقد نجحوا لأنهم كانوا على استعداد لتحدي افتراضاتهم الأولية.",
      "image_url": "fusion_hearth.png",
      "choices": [
        {
          "choice_text_ar": "النهاية: نجاح من خلال المحور.",
          "next_node_id": "ending_success"
        }
      ]
    },
    {
      "node_id": "ending_success",
      "text_ar": "من خلال البدء صغيرًا، والاستماع بعناية، والتكيف بجرأة، لم تعيد إيلارا وليام الطاقة إلى هافنوود فحسب، بل أعادا أيضًا الأمل والمرونة. أصبح مشروعهم منارة للابتكار، وكل ذلك تم بناؤه على مبادئ منهجية لين الناشئة. لقد تعلموا أن بناء شيء دائم يبدأ بالاستعداد للتغيير.",
      "image_url": "ending_success.png"
    }
  ]
}
